---
kind: method
id: M:Autodesk.Revit.DB.NurbsSurfaceData.IsValid
source: html/6ca835bb-02f9-fe37-01ef-618310cef5ab.htm
---
# Autodesk.Revit.DB.NurbsSurfaceData.IsValid Method

Check if the object contains a valid NurbsSurfaceData.

## Syntax (C#)
```csharp
public bool IsValid()
```

## Returns
True if it is a valid NurbsSurfaceData, false otherwise.